'''Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
Определите минимальное число монеток, которые нужно перевернуть, чтобы все'' монетки были повернуты 
вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть'''


#import random

#from random import randint

#amount_coin = int(input('введите количество монет: '))

#m = 0
#k = 0
#coins = [0, 1]
#for i in range(amount_coin):
#     random.shuffle(coins)
 #    print(f'все монеты{coins}')